RoboEvangelist/TivaWare_C_Series-2.1.0.12573/examples/boards/ek-tm4c1294xl-boost-cc3000/cc3000_basic_wifi_application/cc3000_basic_wifi_application.c
        g_ui32SmartConfigFinished = 1;
        g_ui8StopSmartConfig = 1;
    }

    //
    // Handle unsolicited connect callback.
    //
    if(lEventType == HCI_EVNT_WLAN_UNSOL_CONNECT)
    {
        //
        // Set global variable to indicate connection.
        //
        g_ui32CC3000Connected = 1;
    }

    //
    // Handle unsolicited disconnect callback. Turn LED Green -> Red.
    //
    if(lEventType == HCI_EVNT_WLAN_UNSOL_DISCONNECT)
    {
        UARTprintf("\r    Received Unsolicited Disconnect from CC3000\n>");

        g_ui32CC3000Connected = 0;
        g_ui32CC3000DHCP = 0;
        g_ui32CC3000DHCP_configured = 0;

        //
        // Turn off the LED3.
        //
        turnLedOff(LED3);

        //
        // Turn back on the LED1.
        //
        turnLedOn(LED1);
    }

    //
    // Handle DHCP connection callback.
    //
    if(lEventType == HCI_EVNT_WLAN_UNSOL_DHCP)
    {
        //
        // Notes:
        // 1) IP config parameters are received swapped
        // 2) IP config parameters are valid only if status is OK,
        //      i.e. g_ui32CC3000DHCP becomes 1
        //

        //
        // Only if status is OK, the flag is set to 1 and the addresses are
        // valid
        //
        if( *(pcData + NETAPP_IPCONFIG_MAC_OFFSET) == 0)
        {
            UARTprintf("\r    DHCP Connected. IP: %d.%d.%d.%d\n",
                       pcData[3], pcData[2], pcData[1], pcData[0]);

            //
            // DHCP success, set global accordingly.
            //
            g_ui32CC3000DHCP = 1;

            //
            // Turn on the LED3.
            //
            turnLedOn(LED3);
        }
        else
        {
            //
            // DHCP failed, set global accordingly.
            //
            g_ui32CC3000DHCP = 0;
        }
    }
    //
    // Ping event handler
    //
    if(lEventType == HCI_EVNT_WLAN_ASYNC_PING_REPORT)
    {
        //
        // Ping data received, print to screen
        //
        psPingData = (netapp_pingreport_args_t *)pcData;
#ifdef DEBUG
        UARTprintf("    Data Received='\n");
        for(lEventType = 0; lEventType < ucLength; lEventType++)
        {
            UARTprintf("%d,",pcData[lEventType]);
        }
        UARTprintf("'\n");
#endif

        //
        // Test for ping failure
        //
        if(psPingData->min_round_time == -1)
        {
            UARTprintf("\r    Ping Failed. Please check address and try "
                       "again.\n>");
        }
        else
        {
            UARTprintf("\r    Ping Results:\n"
                       "    sent: %d, received: %d, min time: %dms,"
                       " max time: %dms, avg time: %dms\n>",
                       psPingData->packets_sent, psPingData->packets_received,
                       psPingData->min_round_time, psPingData->max_round_time,
                       psPingData->avg_round_time);
        }
    }

    //
    // Handle shutdown callback.
    //
    if(lEventType == HCI_EVENT_CC3000_CAN_SHUT_DOWN)
    {
        //
        // Set global variable to indicate the device can be shutdown.
        //
        g_ui32OkToDoShutDown = 1;
    }
}

//*****************************************************************************
//
// This function initializes a CC3000 device and triggers it to start
// operation
//
//*****************************************************************************
int
initDriver(void)
{
    //
    // Initialize the system clock and board pinout.
    //
    pio_init();

    //
    // Initialize SPI
    //
    init_spi(1000000,g_ui32SysClock);
	

    //
    // Enable processor interrupts.
    //
    MAP_IntMasterEnable();

    //
    // Initialize the CC3000 firmware.
    //
    wlan_init(CC3000_UsynchCallback, sendWLFWPatch, sendDriverPatch,
              sendBootLoaderPatch, ReadWlanInterruptPin,
              WlanInterruptEnable, WlanInterruptDisable, WriteWlanPin);

    //
    // Start the WiFI stack on the CC3000.
    //
    wlan_start(0);

    //
    // Turn on the LED1 to indicate that we are active and initiated
    // WLAN successfully.
    //
    turnLedOn(LED1);

    //
    // Mask out all non-required events from CC3000
    //
    wlan_set_event_mask(HCI_EVNT_WLAN_KEEPALIVE | HCI_EVNT_WLAN_UNSOL_INIT);

    DispatcherUARTConfigure(g_ui32SysClock);

    ROM_SysCtlDelay(1000000);

    //
    // Print version string.
    //
    UARTprintf("\n\n\rCC3000 Basic Wifi Application: driver version "
                "%d.%d.%d.%d \n\r",PLATFORM_VERSION, APPLICATION_VERSION,
                SPI_VERSION_NUMBER, DRIVER_VERSION_NUMBER );
    UARTprintf("Type 'help' for a list of commands\n");

    //
    // Set flag to stop smart config if running.
    //
    g_ui8StopSmartConfig = 0;

    //
    // Configure SysTick to occur X times per second, to use as a time
    // reference. Enable SysTick to generate interrupts.
    //
    InitSysTick();

    return(0);
}

//*****************************************************************************
//
// Takes in a string of the form YYY.YYY.YYY.YYY (where YYY is a string
// representation of a decimal between0 and 255), converts each pair to a
// decimal. Used to parse user input from the command line.
//
// Returns 0 on success, -1 on fail.
//
//*****************************************************************************
int
DotDecimalDecoder(char *pcString, uint8_t *pui8Val1, uint8_t *pui8Val2,
                  uint8_t *pui8Val3, uint8_t *pui8Val4)
{
    uint32_t ui32Block1,ui32Block2,ui32Block3,ui32Block4;
    char *pcEndData, *pcStartData;

    //
    // Extract 1st octet of address.
    //
    pcStartData = pcString;
    pcEndData = ustrstr(pcStartData,".");
    ui32Block1 = ustrtoul(pcStartData, 0,10);

    //
    // Extract 2nd octet of address.
    //
    pcStartData = pcEndData +1;
    pcEndData = ustrstr(pcStartData,".");
    ui32Block2 = ustrtoul(pcStartData, 0,10);

    //
    // Extract 3rd octet of address.
    //
    pcStartData = pcEndData +1;
    pcEndData = ustrstr(pcStartData,".");
    ui32Block3 = ustrtoul(pcStartData, 0,10);

    //
    // Extract 4th octet of address.
    //
    pcStartData = pcEndData +1;
    pcEndData = ustrstr(pcStartData,".");
    ui32Block4 = ustrtoul(pcStartData, 0,10);

    //
    // Validate data. Valid values are between 0->255.
    //
    if((ui32Block1 > 255) || (ui32Block2 > 255) || (ui32Block3 > 255) ||
       (ui32Block4 > 255))
    {
        //
        // Exit with failure if any values are > 255
        //
        return(COMMAND_FAIL);
    }

    //
    // Assign address values to variables passed in
    //
    *pui8Val1 = (uint8_t)ui32Block1;
    *pui8Val2 = (uint8_t)ui32Block2;
    *pui8Val3 = (uint8_t)ui32Block3;
    *pui8Val4 = (uint8_t)ui32Block4;

    return(0);
}

//*****************************************************************************
//
// Table of valid command strings, callback functions and help messages.  This
// is used by the cmdline module.
//
//*****************************************************************************
tCmdLineEntry g_psCmdTable[] =
{
    {"help",          CMD_help,
                  " : Display this list of commands." },
    {"smartconfig",   CMD_smartConfig,
                  " : First time simple configuration. Use app on smartphone\n"
"                     to connect to network." },
    {"connect",       CMD_connect,
                  " : [1]SSID : Connect to an open access point." },
    {"ipconfig",      CMD_ipConfig,
                  " : [1]Local IP address [2]Default gateway\n"
"                     [3](optional) Network mask. For DHCP give no arguments."},
    {"socketopen",    CMD_socketOpen,
                  " : [1]UDP/TCP : Open socket, specify TCP or UDP." },
    {"bind",          CMD_bind,
                  " : [1]Port to bind socket to" },
    {"senddata",      CMD_sendData,
                  " : [1]IP Address [2]Destination Port\n"
"                     [3]Data to send ( < 255 bytes, no spaces allowed)." },
    {"receivedata",   CMD_receiveData,
                  " : Receive data on a socket." },
    {"mdnsadvertise", CMD_mdnsadvertise,
                  " : [1](optional) name to broadcast via mDNS to "
                  "connected network." },
    {"resetcc3000",   CMD_cc3000reset,
                  " : Reset the CC3000."},
    {"socketclose",   CMD_socketClose,
                  " : Close the open socket." },
    {"disconnect",    CMD_disconnect,
                  " : Disconnect from the network." },
    {"deletepolicy",  CMD_deletePolicy,
                  " : Delete the automatic connection policy. On reset CC3000\n"
"                     will not automatically reconnect to the network." },
    {"ping",          CMD_ping,
                  " : [1]IP [2](optional) Maximum tries,\n"
"                     [3](optional) Timeout in ms."},
    { 0, 0, 0 }
};

//*****************************************************************************
//
// This function triggers a smart configuration process on CC3000.
//
//*****************************************************************************
void StartSmartConfig(void)
{
    g_ui32SmartConfigFinished = 0;
    g_ui32CC3000Connected = 0;
    g_ui32CC3000DHCP = 0;
    g_ui32OkToDoShutDown=0;

    //
    // Reset all the previous configuration
    //
    wlan_ioctl_set_connection_policy(DISABLE, DISABLE, DISABLE);

    //
    // Delete all previous profiles. 255 means delete all.
    //
    wlan_ioctl_del_profile(255);

    //
    // Inform user of status.
    //
    UARTprintf("    Waiting on Smartphone Smart Config App...\n");

    //
    // Wait until CC3000 is disconnected
    //
    while(g_ui32CC3000Connected == 1)
    {
        ROM_SysCtlDelay(100);
        hci_unsolicited_event_handler();
    }

    //
    // Start blinking LED1 during Smart Configuration process.
    //
    turnLedOn(LED1);

    //
    // Set the prefix used for smart config.
    //
    wlan_smart_config_set_prefix(g_pcCC3000_prefix);
    turnLedOff(LED1);

    //
    // Start the SmartConfig process.
    //
    wlan_smart_config_start(1);
    turnLedOn(LED1);

    //
    // Wait for Smart config to finish. Flash LED.
    //
    while(g_ui32SmartConfigFinished == 0)
    {
        turnLedOff(LED1);
        ROM_SysCtlDelay(16500000);
        turnLedOn(LED1);
        ROM_SysCtlDelay(16500000);
    }
    turnLedOn(LED1);

    //
    // Create new entry for AES encryption key.
    //
    nvmem_create_entry(NVMEM_AES128_KEY_FILEID,16);

    //
    // Write AES key to NVMEM.
    //
    aes_write_key((unsigned char *)(&g_pui8smartconfigkey[0]));

    //
    // Decrypt configuration information and add profile.
    //
    wlan_smart_config_process();

    //
    // Configure to connect automatically to the AP retrieved in the
    // Smart config process.
    //
    wlan_ioctl_set_connection_policy(DISABLE, DISABLE, ENABLE);

    //
    // Reset the CC3000, necessary to apply configuration.
    //
    wlan_stop();

    //
    // Tell user we're done with smart config.
    //
    UARTprintf("\r    Smart Config DONE\n");

    //
    // Mandatory delay between calls to wlan_stop and wlan_start.
    //
    ROM_SysCtlDelay(g_ui32SysClock / 3000);
    //
    // Start up the CC3000 again.
    //
    wlan_start(0);

    //
    // Mask out all non-required events, these events will be ignored by the
    // asynchronous callback.
    //
    wlan_set_event_mask(HCI_EVNT_WLAN_KEEPALIVE | HCI_EVNT_WLAN_UNSOL_INIT);
}

//*****************************************************************************
//
// Print the help strings for all commands.
//
//*****************************************************************************
int
CMD_help(int argc, char **argv)
{
    int32_t i32Index;

    (void)argc;
    (void)argv;

    //
    // Start at the beginning of the command table.
    //
    i32Index = 0;

    //
    // Get to the start of a clean line on the serial output.
    //
    UARTprintf("\nAvailable Commands\n------------------\n\n");

    //
    // Display strings until we run out of them.
    //
    while(g_psCmdTable[i32Index].pcCmd)
    {
        //
        // Display one command's help information.
        //
        UARTprintf("%17s %s\n", g_psCmdTable[i32Index].pcCmd,
                   g_psCmdTable[i32Index].pcHelp);
        i32Index++;

        //
        // Make sure the text makes it to the host.  Without this flush call,
        // we can overflow the transmit buffer and lose some of the help
        // information.
        //
        UARTFlushTx(false);
    }

    //
    // Leave a blank line after the help strings.
    //
    UARTprintf("\n");

    return(0);
}

//*****************************************************************************
//
// This function runs the Smart Configuration process.
// This function is meant to be run in tandem with the smartphone
// application. The user enters the network information on the smart phone and
// then saves it to the microcontroller. Easiest way to connect CC3000 to a
// network.
//
//*****************************************************************************
int
CMD_smartConfig(int argc, char **argv)
{
    StartSmartConfig();

    return(0);
}

//*****************************************************************************
//
// Manually connect to an open network. For advanced users.
// Arguments:
// [1]SSID
//
//*****************************************************************************
int
CMD_connect(int argc, char **argv)
{
    uint32_t ui32SsidLen, ui32x;
    char *pui8Ssid;

    //
    // Validate input.
    //
    if(argc < 2)
    {
        return(CMDLINE_TOO_FEW_ARGS);
    }
    else if(argc > 2)
    {
        return(CMDLINE_TOO_MANY_ARGS);
    }
    else if(strlen(argv[1]) >= 255)
    {
        UARTprintf("Length of SSID must be less than 255\n");
        return(CMDLINE_INVALID_ARG);
    }

    //
    // Extract the SSID from the input parameters and determine the string
    // length.
    //
    pui8Ssid = argv[1];
    ui32SsidLen = ustrlen(argv[1]);

    //
    // Call low level connect function. See documentation for more information.
    //
#ifndef CC3000_TINY_DRIVER
    wlan_connect(WLAN_SEC_UNSEC, pui8Ssid, ui32SsidLen,NULL, NULL, 0);
#else
    wlan_connect(pui8Ssid,ui32SsidLen);
#endif

    //
    // Tell user what we're doing.
    //
    UARTprintf("    Attempting to connect (5 second timeout)...\n");

    //
    // Wait for connect message for 5 seconds,
    //
    for(ui32x = 0; ui32x < 5000; ui32x++)
    {
        //
        // Check to see if we're connected to a network yet.
        //
        if(g_ui32CC3000DHCP == 1)
        {
            return(0);
        }

        //
        // Delay 1ms
        //
        ROM_SysCtlDelay(g_ui32SysClock / 3000);
    }
    UARTprintf("    Connection Failed. Please check the network name.\n");

    return(0);

